vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32c092/RCC_registers.h
/* This file is generated by stm32_reggen.py from stm32c092xx.h
 * Do not edit this file manually! 
 * If corrections are needed, use the 
 * override mechanism(s) defined to modify the parsed results 
 * and re-run the script to update the file. 
 *
 * This file contains the RCC register type definitions for the stm32c092 series of chips. 
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "RCC_index.h"


typedef union { 
	struct {
		uint32_t _reserved0    : 2; 
		uint32_t SYSDIV        : 3; // /*!< Clock division factor for system clock */
		uint32_t HSIKERDIV     : 3; // /*!< HSI48 clock division factor for HSI kernel clocks inputs */
		uint32_t HSION         : 1; // /*!< Internal High Speed clock enable */
		uint32_t HSIKERON      : 1; // /*!< Internal High Speed clock enable for some IPs Kernel */
		uint32_t HSIRDY        : 1; // /*!< Internal High Speed clock ready flag */
		uint32_t HSIDIV        : 3; // /*!< HSIDIV[13:11] Internal High Speed clock division factor */
		uint32_t _reserved14   : 2; 
		uint32_t HSEON         : 1; // /*!< External High Speed clock enable */
		uint32_t HSERDY        : 1; // /*!< External High Speed clock ready */
		uint32_t HSEBYP        : 1; // /*!< External High Speed clock Bypass */
		uint32_t CSSON         : 1; // /*!< HSE Clock Security System enable */
		uint32_t _reserved20   :12; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,cr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,cr),bits);

typedef union { 
	struct {
		uint32_t HSICAL        : 8; // /*!< HSICAL[7:0] bits */
		uint32_t HSITRIM       : 7; // /*!< HSITRIM[14:8] bits */
		uint32_t _reserved15   :17; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,icscr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,icscr),bits);

typedef union { 
	struct {
		uint32_t SW            : 3; // /*!< SW[2:0] bits (System clock Switch) */
		uint32_t SWS           : 3; // /*!< SWS[2:0] bits (System Clock Switch Status) */
		uint32_t _reserved6    : 2; 
		uint32_t HPRE          : 4; // /*!< HPRE[3:0] bits (AHB prescaler) */
		uint32_t PPRE          : 3; // /*!< PRE1[2:0] bits (APB prescaler) */
		uint32_t _reserved15   : 1; 
		uint32_t MCO2SEL       : 3; // /*!< MCO2SEL [2:0] bits (Clock output selection) */
		uint32_t _reserved19   : 1; 
		uint32_t MCO2PRE       : 4; // /*!< MCO prescaler [3:0] */
		uint32_t MCOSEL        : 3; // /*!< MCOSEL [2:0] bits (Clock output selection) */
		uint32_t _reserved27   : 1; 
		uint32_t MCOPRE        : 4; // /*!< MCO prescaler [3:0] */
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,cfgr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,cfgr),bits);

typedef union { 
	struct {
		uint32_t LSIRDYIE      : 1; 
		uint32_t LSERDYIE      : 1; 
		uint32_t _reserved2    : 1; 
		uint32_t HSIRDYIE      : 1; 
		uint32_t HSERDYIE      : 1; 
		uint32_t _reserved5    :27; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,cier); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,cier),bits);

typedef union { 
	struct {
		uint32_t LSIRDYF       : 1; 
		uint32_t LSERDYF       : 1; 
		uint32_t _reserved2    : 1; 
		uint32_t HSIRDYF       : 1; 
		uint32_t HSERDYF       : 1; 
		uint32_t _reserved5    : 3; 
		uint32_t CSSF          : 1; 
		uint32_t LSECSSF       : 1; 
		uint32_t _reserved10   :22; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,cifr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,cifr),bits);

typedef union { 
	struct {
		uint32_t LSIRDYC       : 1; 
		uint32_t LSERDYC       : 1; 
		uint32_t _reserved2    : 1; 
		uint32_t HSIRDYC       : 1; 
		uint32_t HSERDYC       : 1; 
		uint32_t _reserved5    : 3; 
		uint32_t CSSC          : 1; 
		uint32_t LSECSSC       : 1; 
		uint32_t _reserved10   :22; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,cicr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,cicr),bits);

typedef union { 
	struct {
		uint32_t GPIOARST      : 1; 
		uint32_t GPIOBRST      : 1; 
		uint32_t GPIOCRST      : 1; 
		uint32_t GPIODRST      : 1; 
		uint32_t _reserved4    : 1; 
		uint32_t GPIOFRST      : 1; 
		uint32_t _reserved6    :26; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,ioprstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,ioprstr),bits);

typedef union { 
	struct {
		uint32_t DMA1RST       : 1; 
		uint32_t _reserved1    : 7; 
		uint32_t FLASHRST      : 1; 
		uint32_t _reserved9    : 3; 
		uint32_t CRCRST        : 1; 
		uint32_t _reserved13   :19; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,ahbrstr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,ahbrstr),bits);

typedef union { 
	struct {
		uint32_t TIM2RST       : 1; 
		uint32_t TIM3RST       : 1; 
		uint32_t _reserved2    :10; 
		uint32_t FDCAN1RST     : 1; 
		uint32_t _reserved13   : 1; 
		uint32_t SPI2RST       : 1; 
		uint32_t _reserved15   : 2; 
		uint32_t USART2RST     : 1; 
		uint32_t USART3RST     : 1; 
		uint32_t USART4RST     : 1; 
		uint32_t _reserved20   : 1; 
		uint32_t I2C1RST       : 1; 
		uint32_t I2C2RST       : 1; 
		uint32_t _reserved23   : 4; 
		uint32_t DBGRST        : 1; 
		uint32_t PWRRST        : 1; 
		uint32_t _reserved29   : 3; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,apbrstr1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,apbrstr1),bits);

typedef union { 
	struct {
		uint32_t SYSCFGRST     : 1; 
		uint32_t _reserved1    :10; 
		uint32_t TIM1RST       : 1; 
		uint32_t SPI1RST       : 1; 
		uint32_t _reserved13   : 1; 
		uint32_t USART1RST     : 1; 
		uint32_t TIM14RST      : 1; 
		uint32_t TIM15RST      : 1; 
		uint32_t TIM16RST      : 1; 
		uint32_t TIM17RST      : 1; 
		uint32_t _reserved19   : 1; 
		uint32_t ADCRST        : 1; 
		uint32_t _reserved21   :11; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,apbrstr2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,apbrstr2),bits);

typedef union { 
	struct {
		uint32_t GPIOAEN       : 1; 
		uint32_t GPIOBEN       : 1; 
		uint32_t GPIOCEN       : 1; 
		uint32_t GPIODEN       : 1; 
		uint32_t _reserved4    : 1; 
		uint32_t GPIOFEN       : 1; 
		uint32_t _reserved6    :26; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,iopenr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,iopenr),bits);

typedef union { 
	struct {
		uint32_t DMA1EN        : 1; 
		uint32_t _reserved1    : 7; 
		uint32_t FLASHEN       : 1; 
		uint32_t _reserved9    : 3; 
		uint32_t CRCEN         : 1; 
		uint32_t _reserved13   :19; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,ahbenr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,ahbenr),bits);

typedef union { 
	struct {
		uint32_t TIM2EN        : 1; 
		uint32_t TIM3EN        : 1; 
		uint32_t _reserved2    : 8; 
		uint32_t RTCAPBEN      : 1; 
		uint32_t WWDGEN        : 1; 
		uint32_t FDCAN1EN      : 1; 
		uint32_t _reserved13   : 1; 
		uint32_t SPI2EN        : 1; 
		uint32_t _reserved15   : 2; 
		uint32_t USART2EN      : 1; 
		uint32_t USART3EN      : 1; 
		uint32_t USART4EN      : 1; 
		uint32_t _reserved20   : 1; 
		uint32_t I2C1EN        : 1; 
		uint32_t I2C2EN        : 1; 
		uint32_t _reserved23   : 4; 
		uint32_t DBGEN         : 1; 
		uint32_t PWREN         : 1; 
		uint32_t _reserved29   : 3; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,apbenr1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,apbenr1),bits);

typedef union { 
	struct {
		uint32_t SYSCFGEN      : 1; 
		uint32_t _reserved1    :10; 
		uint32_t TIM1EN        : 1; 
		uint32_t SPI1EN        : 1; 
		uint32_t _reserved13   : 1; 
		uint32_t USART1EN      : 1; 
		uint32_t TIM14EN       : 1; 
		uint32_t TIM15EN       : 1; 
		uint32_t TIM16EN       : 1; 
		uint32_t TIM17EN       : 1; 
		uint32_t _reserved19   : 1; 
		uint32_t ADCEN         : 1; 
		uint32_t _reserved21   :11; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,apbenr2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,apbenr2),bits);

typedef union { 
	struct {
		uint32_t GPIOASMEN     : 1; 
		uint32_t GPIOBSMEN     : 1; 
		uint32_t GPIOCSMEN     : 1; 
		uint32_t GPIODSMEN     : 1; 
		uint32_t _reserved4    : 1; 
		uint32_t GPIOFSMEN     : 1; 
		uint32_t _reserved6    :26; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,iopsmenr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,iopsmenr),bits);

typedef union { 
	struct {
		uint32_t DMA1SMEN      : 1; 
		uint32_t _reserved1    : 7; 
		uint32_t FLASHSMEN     : 1; 
		uint32_t SRAMSMEN      : 1; 
		uint32_t _reserved10   : 2; 
		uint32_t CRCSMEN       : 1; 
		uint32_t _reserved13   :19; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,ahbsmenr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,ahbsmenr),bits);

typedef union { 
	struct {
		uint32_t TIM2SMEN      : 1; 
		uint32_t TIM3SMEN      : 1; 
		uint32_t _reserved2    : 8; 
		uint32_t RTCAPBSMEN    : 1; 
		uint32_t WWDGSMEN      : 1; 
		uint32_t FDCAN1SMEN    : 1; 
		uint32_t _reserved13   : 1; 
		uint32_t SPI2SMEN      : 1; 
		uint32_t _reserved15   : 2; 
		uint32_t USART2SMEN    : 1; 
		uint32_t USART3SMEN    : 1; 
		uint32_t USART4SMEN    : 1; 
		uint32_t _reserved20   : 1; 
		uint32_t I2C1SMEN      : 1; 
		uint32_t I2C2SMEN      : 1; 
		uint32_t _reserved23   : 4; 
		uint32_t DBGSMEN       : 1; 
		uint32_t PWRSMEN       : 1; 
		uint32_t _reserved29   : 3; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,apbsmenr1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,apbsmenr1),bits);

typedef union { 
	struct {
		uint32_t SYSCFGSMEN    : 1; 
		uint32_t _reserved1    :10; 
		uint32_t TIM1SMEN      : 1; 
		uint32_t SPI1SMEN      : 1; 
		uint32_t _reserved13   : 1; 
		uint32_t USART1SMEN    : 1; 
		uint32_t TIM14SMEN     : 1; 
		uint32_t TIM15SMEN     : 1; 
		uint32_t TIM16SMEN     : 1; 
		uint32_t TIM17SMEN     : 1; 
		uint32_t _reserved19   : 1; 
		uint32_t ADCSMEN       : 1; 
		uint32_t _reserved21   :11; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,apbsmenr2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,apbsmenr2),bits);

typedef union { 
	struct {
		uint32_t USART1SEL     : 2; 
		uint32_t _reserved2    : 6; 
		uint32_t FDCAN1SEL     : 2; 
		uint32_t _reserved10   : 2; 
		uint32_t I2C1SEL       : 2; 
		uint32_t I2S1SEL       : 2; 
		uint32_t _reserved16   :14; 
		uint32_t ADCSEL        : 2; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,ccipr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,ccipr),bits);

typedef union { 
	struct {
		uint32_t LSEON         : 1; 
		uint32_t LSERDY        : 1; 
		uint32_t LSEBYP        : 1; 
		uint32_t LSEDRV        : 2; 
		uint32_t LSECSSON      : 1; 
		uint32_t LSECSSD       : 1; 
		uint32_t _reserved7    : 1; 
		uint32_t RTCSEL        : 2; 
		uint32_t _reserved10   : 5; 
		uint32_t RTCEN         : 1; 
		uint32_t RTCRST        : 1; 
		uint32_t _reserved17   : 7; 
		uint32_t LSCOEN        : 1; 
		uint32_t LSCOSEL       : 1; 
		uint32_t _reserved26   : 6; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,csr1); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,csr1),bits);

typedef union { 
	struct {
		uint32_t LSION         : 1; 
		uint32_t LSIRDY        : 1; 
		uint32_t _reserved2    :21; 
		uint32_t RMVF          : 1; 
		uint32_t _reserved24   : 1; 
		uint32_t OBLRSTF       : 1; 
		uint32_t PINRSTF       : 1; 
		uint32_t PWRRSTF       : 1; 
		uint32_t SFTRSTF       : 1; 
		uint32_t IWDGRSTF      : 1; 
		uint32_t WWDGRSTF      : 1; 
		uint32_t LPWRRSTF      : 1; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_rcc,csr2); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_rcc,csr2),bits);

static const stm32_reginfo_t stm32_c092_rcc_reginfo[RI_END] = 
{ 
	[RI_CR             ] = { .reset_val = 0x00001540, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000F3FFC }, /* mask = 0b00000000000011110011111111111100 */
	[RI_ICSCR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00007FFF, .mask = 0x00007FFF }, /* mask = 0b00000000000000000111111111111111 */
	[RI_CFGR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xF7F77F3F }, /* mask = 0b11110111111101110111111100111111 */
	[RI_CIER           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000001B }, /* mask = 0b00000000000000000000000000011011 */
	[RI_CIFR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000031B }, /* mask = 0b00000000000000000000001100011011 */
	[RI_CICR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000031B }, /* mask = 0b00000000000000000000001100011011 */
	[RI_IOPRSTR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000002F }, /* mask = 0b00000000000000000000000000101111 */
	[RI_AHBRSTR        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00001101 }, /* mask = 0b00000000000000000001000100000001 */
	[RI_APBRSTR1       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x186E5003 }, /* mask = 0b00011000011011100101000000000011 */
	[RI_APBRSTR2       ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0017D801 }, /* mask = 0b00000000000101111101100000000001 */
	[RI_IOPENR         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000002F }, /* mask = 0b00000000000000000000000000101111 */
	[RI_AHBENR         ] = { .reset_val = 0x00000100, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00001101 }, /* mask = 0b00000000000000000001000100000001 */
	[RI_APBENR1        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x186E5C03 }, /* mask = 0b00011000011011100101110000000011 */
	[RI_APBENR2        ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0017D801 }, /* mask = 0b00000000000101111101100000000001 */
	[RI_IOPSMENR       ] = { .reset_val = 0x0000002F, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000002F }, /* mask = 0b00000000000000000000000000101111 */
	[RI_AHBSMENR       ] = { .reset_val = 0x00001301, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00001301 }, /* mask = 0b00000000000000000001001100000001 */
	[RI_APBSMENR1      ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x186E5C03 }, /* mask = 0b00011000011011100101110000000011 */
	[RI_APBSMENR2      ] = { .reset_val = 0x0017D801, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0017D801 }, /* mask = 0b00000000000101111101100000000001 */
	[RI_CCIPR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xC000F303 }, /* mask = 0b11000000000000001111001100000011 */
	[RI_CSR1           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0301837F }, /* mask = 0b00000011000000011000001101111111 */
	[RI_CSR2           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFE800003 }, /* mask = 0b11111110100000000000000000000011 */
}; 

typedef union { 
	struct {
		REGDEF_NAME(c092_rcc,cr) CR;
		REGDEF_NAME(c092_rcc,icscr) ICSCR;
		REGDEF_NAME(c092_rcc,cfgr) CFGR;
		uint32_t _reserved0xC[ 3]; 
		REGDEF_NAME(c092_rcc,cier) CIER;
		REGDEF_NAME(c092_rcc,cifr) CIFR;
		REGDEF_NAME(c092_rcc,cicr) CICR;
		REGDEF_NAME(c092_rcc,ioprstr) IOPRSTR;
		REGDEF_NAME(c092_rcc,ahbrstr) AHBRSTR;
		REGDEF_NAME(c092_rcc,apbrstr1) APBRSTR1;
		REGDEF_NAME(c092_rcc,apbrstr2) APBRSTR2;
		REGDEF_NAME(c092_rcc,iopenr) IOPENR;
		REGDEF_NAME(c092_rcc,ahbenr) AHBENR;
		REGDEF_NAME(c092_rcc,apbenr1) APBENR1;
		REGDEF_NAME(c092_rcc,apbenr2) APBENR2;
		REGDEF_NAME(c092_rcc,iopsmenr) IOPSMENR;
		REGDEF_NAME(c092_rcc,ahbsmenr) AHBSMENR;
		REGDEF_NAME(c092_rcc,apbsmenr1) APBSMENR1;
		REGDEF_NAME(c092_rcc,apbsmenr2) APBSMENR2;
		REGDEF_NAME(c092_rcc,ccipr) CCIPR;
		uint32_t _reserved0x58;
		REGDEF_NAME(c092_rcc,csr1) CSR1;
		REGDEF_NAME(c092_rcc,csr2) CSR2;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END]; 
}  REGDEF_NAME(c092,rcc); 
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(c092,rcc)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CR) != 0, "Offset mismatch for CR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), ICSCR) != 4, "Offset mismatch for ICSCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CFGR) != 8, "Offset mismatch for CFGR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CIER) != 24, "Offset mismatch for CIER");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CIFR) != 28, "Offset mismatch for CIFR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CICR) != 32, "Offset mismatch for CICR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), IOPRSTR) != 36, "Offset mismatch for IOPRSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), AHBRSTR) != 40, "Offset mismatch for AHBRSTR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), APBRSTR1) != 44, "Offset mismatch for APBRSTR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), APBRSTR2) != 48, "Offset mismatch for APBRSTR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), IOPENR) != 52, "Offset mismatch for IOPENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), AHBENR) != 56, "Offset mismatch for AHBENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), APBENR1) != 60, "Offset mismatch for APBENR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), APBENR2) != 64, "Offset mismatch for APBENR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), IOPSMENR) != 68, "Offset mismatch for IOPSMENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), AHBSMENR) != 72, "Offset mismatch for AHBSMENR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), APBSMENR1) != 76, "Offset mismatch for APBSMENR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), APBSMENR2) != 80, "Offset mismatch for APBSMENR2");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CCIPR) != 84, "Offset mismatch for CCIPR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CSR1) != 92, "Offset mismatch for CSR1");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,rcc), CSR2) != 96, "Offset mismatch for CSR2");
